blog/2019/03/19/pipenv-jupyter/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>Using Pipenv &amp; Jupyter - jtmoulia</title>
  <meta charset="utf-8" />
  <meta name="author" content="Thomas Moulia" />
    <meta name="description" content="Getting started with jupyter using pipenv" />
    <meta name="keywords" content="pipenv, jupyter, python" />
  <!-- TODO Concatenate CSS -->
  <link rel="stylesheet" href="/media/css/normalize.css" type="text/css">
  <link rel="stylesheet" href="/media/css/skeleton.css" type="text/css">
  <link rel="stylesheet" href="/media/css/prettify.css" type="text/css">
  <link href='https://fonts.googleapis.com/css?family=Merriweather:400,700,300italic' rel='stylesheet' type='text/css'>
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
</head>

  <body class="container">
<div class="masthead">
  <div class="masthead-title-div u-pull-left">
    <h1 class="masthead-title"><a href="/">
      jtmoulia
    </a></h1>
    <!-- TODO Who needs a sub-title?? -->
    <!-- <p class="masthead-sub-title"> -->
    <!-- public notebook 📓 -->
    <!-- </p> -->
  </div>
  <nav class="navbar u-pull-right">
    <ul class="navbar-list">
      <li><a href="/blog/">Posts</a></li>
      <li><a href="/about/">Who</a></li>
    </ul>
  </nav>
</div>
<div class="u-cf"></div>

    <!-- <div> -->
    <!--   <header class="masthead"> -->
    <!--     <h1 class="masthead-title"><a href="/">jtmoulia</a></h1> -->
    <!--     <p>public notebook 📓</p> -->
    <!--     <ul> -->
    <!--        -->
    <!--       <li><a href="/blog/">Blog</a></li> -->
    <!--        -->
    <!--       <li><a href="/tags/">Tags</a></li> -->
    <!--       <li><a href="/about/">About</a></li> -->
    <!--       <li><a href="http://github.com/jtmoulia">GitHub</a></li> -->
    <!--       <li><a href="/rss.xml">RSS</a></li> -->
    <!--     </ul> -->
    <!--     <form method="get" id="searchform" action="http://www.google.com/search"> -->
    <!--       <input type="text" class="field" name="q" id="s" placeholder="Search"> -->
    <!--       <input type="hidden" name="as_sitesearch" value="jtmoulia.pocketknife.io"> -->
    <!--     </form> -->
    <!--      -->
    <!--   </header> -->
    <!-- </div> -->

  <hr />
<div class="content">
  <div class="post">
      <h3>Using Pipenv &amp; Jupyter</h3>
    <p>
<a href="https://www.python.org/">Python</a>'s data analysis packages (<a href="https://pandas.pydata.org/">pandas</a>, <a href="https://scikit-learn.org/stable/">sklearn</a>, <a href="https://spacy.io/">spacy</a>, etc) and user
interfaces (<a href="https://jupyter.org/">Jupyter</a>, <a href="https://ipython.org/">IPython</a>, <a href="http://seaborn.pydata.org/">seaborn</a>) make it a swiss army knife for working
with data. This article sketches out how to quickly set up a Python data
analysis environment using <a href="https://pipenv.readthedocs.io/en/latest/">Pipenv</a> to install Jupyter.
</p>

<div id="outline-container-org8b98675" class="outline-4">
<h4 id="org8b98675">Install Pipenv</h4>
<div class="outline-text-4" id="text-org8b98675">
<p>
The one requirement is <a href="https://pipenv.readthedocs.io/en/latest/install/#installing-pipenv">Pipenv</a> for setting up the Python <a href="https://docs.python.org/3/library/venv.html">venv</a> and installing the
dependencies into it. If you're on OS X <a href="https://brew.sh/">homebrew</a> is a great package manager:
</p>

<div class="org-src-container">
<pre class="src src-sh">brew install pipenv
</pre>
</div>
</div>
</div>

<div id="outline-container-org8ab7d7c" class="outline-4">
<h4 id="org8ab7d7c">Set up the venv</h4>
<div class="outline-text-4" id="text-org8ab7d7c">
<p>
Pipenv identifies which venv should be used by the working directory, so first
create and navigate into your project directory:
</p>

<div class="org-src-container">
<pre class="src src-sh">mkdir my-project
<span style="color: #4f97d7;">cd</span> my-project
</pre>
</div>

<p>
With Pipenv you can set up the venv with Jupyter:
</p>

<div class="org-src-container">
<pre class="src src-sh">pipenv install jupyter
</pre>
</div>

<p>
Based on what you need to get done you can install additional data analysis
packages, e.g. <code>pandas</code> for data manipulation, <code>seaborn</code> for visualization, and
<code>spacy</code> for NLP:
</p>

<div class="org-src-container">
<pre class="src src-sh">pipenv install pandas seaborn spacy
</pre>
</div>

<p>
Note that your exact Python environment can be replicated using the <code>Pipfile</code> and <code>Pipfile.lock</code> files.
</p>
</div>
</div>
<div id="outline-container-org773f3fc" class="outline-4">
<h4 id="org773f3fc">Starting the Jupyter Notebook</h4>
<div class="outline-text-4" id="text-org773f3fc">
<p>
Launch the Jupyter kernel and notebook by calling from your project directory:
</p>

<div class="org-src-container">
<pre class="src src-sh">pipenv run jupyter notebook
</pre>
</div>

<p>
Once loaded, Jupyter should automatically launch its filesystem navigator in
your browser. This command will run in the foreground, preventing you from
running any further commands in the same shell.
</p>
</div>

<div id="outline-container-org198b3a0" class="outline-5">
<h5 id="org198b3a0">Importing Python Libraries</h5>
<div class="outline-text-5" id="text-org198b3a0">
<p>
Assuming you installed the libraries described above they can be imported in the
Jupyter notebook by running:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold; font-style: italic;">import</span> pandas <span style="color: #4f97d7; font-weight: bold; font-style: italic;">as</span> pd
<span style="color: #4f97d7; font-weight: bold; font-style: italic;">import</span> seaborn <span style="color: #4f97d7; font-weight: bold; font-style: italic;">as</span> sns
</pre>
</div>

<p>
Here are some other commonly imported packages with their shorthand alias:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold; font-style: italic;">import</span> numpy <span style="color: #4f97d7; font-weight: bold; font-style: italic;">as</span> np
<span style="color: #4f97d7; font-weight: bold; font-style: italic;">import</span> matplotlib.pyplot <span style="color: #4f97d7; font-weight: bold; font-style: italic;">as</span> plt
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7dde7c1" class="outline-4">
<h4 id="org7dde7c1">Connecting the IPython Console</h4>
<div class="outline-text-4" id="text-org7dde7c1">
<p>
To run ad-hoc commands and inspect the state of variables in the notebook you
can connect an IPython console to the running Jupyter notebook. From the project
directory where the Jupyter notebook was launched run:
</p>

<div class="org-src-container">
<pre class="src src-sh">pipenv run jupyter console --existing
</pre>
</div>

<p>
IPython is especially useful for quickly <a href="https://ipython.readthedocs.io/en/stable/interactive/reference.html#dynamic-object-information">looking up documentation</a>.
</p>
</div>
</div>

  </div>
</div>

<div>
    <div class="post-meta row">
      <div class="six columns">
        <p>
          Written by <span title="author" class="post-info">Thomas Moulia</span>
        </p>
        <p>
          Tags: <span title="tags" class="post-info"><a href="/tags/python/">python</a></span>
        </p>
      </div>
      <div class="six columns">
        <p>
          Published:
          <span title="post date" class="post-info">2019-03-19</span>
        </p>
        <p>
          Modified:
          <span title="last modification date" class="post-info">2019-03-19</span>
        </p>
      </div>
    </div>
  <hr />
  <script src="http://code.jquery.com/jquery-latest.min.js"></script>
  <script src="https://cdnjs.cloudflare.com/ajax/libs/prettify/r298/prettify.js"></script>
  <script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
    <script type="text/javascript">
     var _gaq = _gaq || [];
     _gaq.push(['_setAccount', 'UA-60774978-1']);
     _gaq.push(['_trackPageview']);
     (function() {
         var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
         ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
         var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
     })();
    </script>
  <div class="footer container">
    <div class="row">
      <div class="six columns">
        <p>
          Copyright &copy; 2015 -
          <span id="footerYear"></span>
        </p>
        <p>
          by <a href="mailto:jtmoulia &lt;at&gt; gmail &lt;dot&gt; com">Thomas Moulia</a>
        </p>
      </div>
      <div class="six columns">
        <p>Generated by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.x (<a href="http://orgmode.org">Org mode</a> 9.x)</p>
        <p>
          Powered by
          <a href="https://github.com/kelvinh/org-page">org-page</a> and
          <a href="http://getskeleton.com/">skeleton</a>
        </p>
      </div>
    </div>
  </div>
</div>
<script type="text/javascript">document.getElementById("footerYear").innerHTML = (new Date()).getFullYear();</script>

  </body>
</html>
